TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
#define SYSCTL_O_CLKSEM           0x0U    // Clock Control Semaphore Register
#define SYSCTL_O_CLKCFGLOCK1      0x2U    // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1       0x8U    // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2       0xAU    // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3       0xCU    // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1       0xEU    // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT       0x14U   // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS        0x16U   // SYSPLL Status register
#define SYSCTL_O_AUXPLLCTL1       0x18U   // AUXPLL Control register-1
#define SYSCTL_O_AUXPLLMULT       0x1EU   // AUXPLL Multiplier register
#define SYSCTL_O_AUXPLLSTS        0x20U   // AUXPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL     0x22U   // System Clock Divider Select register
#define SYSCTL_O_AUXCLKDIVSEL     0x24U   // Auxillary Clock Divider Select register
#define SYSCTL_O_PERCLKDIVSEL     0x26U   // Peripheral Clock Divider Selet register
#define SYSCTL_O_XCLKOUTDIVSEL    0x28U   // XCLKOUT Divider Select register
#define SYSCTL_O_CLBCLKCTL        0x2AU   // CLB Clocking Control Register
#define SYSCTL_O_LOSPCP           0x2CU   // Low Speed Clock Source Prescalar
#define SYSCTL_O_MCDCR            0x2EU   // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT            0x30U   // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR           0x32U   // XTAL Control Register
#define SYSCTL_O_ETHERCATCLKCTL   0x36U   // ETHERCATCLKCTL
#define SYSCTL_O_CMCLKCTL         0x38U   // CMCLKCTL

#define SYSCTL_O_CPUSYSLOCK1         0x0U    // Lock bit for CPUSYS registers
#define SYSCTL_O_CPUSYSLOCK2         0x2U    // Lock bit for CPUSYS registers
#define SYSCTL_O_PIEVERRADDR         0xAU    // PIE Vector Fetch Error Address register
#define SYSCTL_O_PCLKCR0             0x22U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR1             0x24U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR2             0x26U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR3             0x28U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR4             0x2AU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR6             0x2EU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR7             0x30U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR8             0x32U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR9             0x34U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR10            0x36U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR11            0x38U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR13            0x3CU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR14            0x3EU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR16            0x42U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR17            0x44U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR18            0x46U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR20            0x4AU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR21            0x4CU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR22            0x4EU   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR23            0x50U   // Peripheral Clock Gating Registers
#define SYSCTL_O_SIMRESET            0x70U   // Simulated Reset Register
#define SYSCTL_O_LPMCR               0x76U   // LPM Control Register
#define SYSCTL_O_GPIOLPMSEL0         0x78U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1         0x7AU   // GPIO LPM Wakeup select registers
#define SYSCTL_O_TMR2CLKCTL          0x7CU   // Timer2 Clock Measurement functionality control
                                             // register
#define SYSCTL_O_RESCCLR             0x7EU   // Reset Cause Clear Register
#define SYSCTL_O_RESC                0x80U   // Reset Cause register
#define SYSCTL_O_MCANWAKESTATUS      0x98U   // MCAN Wake Status Register
#define SYSCTL_O_MCANWAKESTATUSCLR   0x9AU   // MCAN Wake Status Clear Register

#define SYSCTL_O_CLA1TASKSRCSELLOCK   0x0U    // CLA1 Task Trigger Source Select Lock Register
#define SYSCTL_O_DMACHSRCSELLOCK      0x4U    // DMA Channel Triger Source Select Lock Register
#define SYSCTL_O_CLA1TASKSRCSEL1      0x6U    // CLA1 Task Trigger Source Select Register-1
#define SYSCTL_O_CLA1TASKSRCSEL2      0x8U    // CLA1 Task Trigger Source Select Register-2
#define SYSCTL_O_DMACHSRCSEL1         0x16U   // DMA Channel Trigger Source Select Register-1
#define SYSCTL_O_DMACHSRCSEL2         0x18U   // DMA Channel Trigger Source Select Register-2

#define SYSCTL_O_DEVCFGLOCK1   0x0U     // Lock bit for DEVCFG registers
#define SYSCTL_O_PARTIDL       0x8U     // Lower 32-bit of Device PART Identification Number
#define SYSCTL_O_PARTIDH       0xAU     // Upper 32-bit of Device PART Identification Number
#define SYSCTL_O_REVID         0xCU     // Device Revision Number
#define SYSCTL_O_PERCNF1       0x60U    // Peripheral Configuration register
#define SYSCTL_O_FUSEERR       0x74U    // e-Fuse error Status register
#define SYSCTL_O_SOFTPRES0     0x82U    // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES1     0x84U    // EMIF Software Reset register
#define SYSCTL_O_SOFTPRES2     0x86U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES3     0x88U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES4     0x8AU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES6     0x8EU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES7     0x90U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES8     0x92U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES9     0x94U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES10    0x96U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES11    0x98U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES13    0x9CU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES14    0x9EU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES16    0xA2U    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES17    0xA4U    // Reserved Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES18    0xA6U    // Reserved Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES20    0xAAU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES21    0xACU    // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES23    0xB0U    // Peripheral Software Reset register
#define SYSCTL_O_CPUSEL0       0xD6U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL1       0xD8U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL2       0xDAU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL4       0xDEU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL5       0xE0U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL6       0xE2U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL7       0xE4U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL8       0xE6U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL9       0xE8U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL11      0xECU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL12      0xEEU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL14      0xF2U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL15      0xF4U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL16      0xF6U    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL18      0xFAU    // CPU Select register for common peripherals
#define SYSCTL_O_CPUSEL25      0x108U   // CPU Select register for common peripherals
#define SYSCTL_O_CPU2RESCTL    0x122U   // CPU2 Reset Control Register
#define SYSCTL_O_RSTSTAT       0x124U   // Reset Status register for secondary C28x CPUs
#define SYSCTL_O_LPMSTAT       0x125U   // LPM Status Register for secondary C28x CPUs
#define SYSCTL_O_USBTYPE       0x19AU   // Configures USB Type for the device
#define SYSCTL_O_ECAPTYPE      0x19BU   // Configures ECAP Type for the device
#define SYSCTL_O_SDFMTYPE      0x19CU   // Configures SDFM Type for the device
#define SYSCTL_O_MEMMAPTYPE    0x19EU   // Configures Memory Map Type for the device

