TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/inc/hw_sysctl.h
#define SYSCTL_O_ADCA_AC          0x0U     // ADCA Master Access Control Register
#define SYSCTL_O_ADCB_AC          0x2U     // ADCB Master Access Control Register
#define SYSCTL_O_ADCC_AC          0x4U     // ADCC Master Access Control Register
#define SYSCTL_O_ADCD_AC          0x6U     // ADCD Master Access Control Register
#define SYSCTL_O_CMPSS1_AC        0x10U    // CMPSS1 Master Access Control Register
#define SYSCTL_O_CMPSS2_AC        0x12U    // CMPSS2 Master Access Control Register
#define SYSCTL_O_CMPSS3_AC        0x14U    // CMPSS3 Master Access Control Register
#define SYSCTL_O_CMPSS4_AC        0x16U    // CMPSS4 Master Access Control Register
#define SYSCTL_O_CMPSS5_AC        0x18U    // CMPSS5 Master Access Control Register
#define SYSCTL_O_CMPSS6_AC        0x1AU    // CMPSS6 Master Access Control Register
#define SYSCTL_O_CMPSS7_AC        0x1CU    // CMPSS7 Master Access Control Register
#define SYSCTL_O_CMPSS8_AC        0x1EU    // CMPSS8 Master Access Control Register
#define SYSCTL_O_DACA_AC          0x28U    // DACA Master Access Control Register
#define SYSCTL_O_DACB_AC          0x2AU    // DACB Master Access Control Register
#define SYSCTL_O_DACC_AC          0x2CU    // DACC Master Access Control Register
#define SYSCTL_O_EPWM1_AC         0x48U    // EPWM1 Master Access Control Register
#define SYSCTL_O_EPWM2_AC         0x4AU    // EPWM2 Master Access Control Register
#define SYSCTL_O_EPWM3_AC         0x4CU    // EPWM3 Master Access Control Register
#define SYSCTL_O_EPWM4_AC         0x4EU    // EPWM4 Master Access Control Register
#define SYSCTL_O_EPWM5_AC         0x50U    // EPWM5 Master Access Control Register
#define SYSCTL_O_EPWM6_AC         0x52U    // EPWM6 Master Access Control Register
#define SYSCTL_O_EPWM7_AC         0x54U    // EPWM7 Master Access Control Register
#define SYSCTL_O_EPWM8_AC         0x56U    // EPWM8 Master Access Control Register
#define SYSCTL_O_EPWM9_AC         0x58U    // EPWM9 Master Access Control Register
#define SYSCTL_O_EPWM10_AC        0x5AU    // EPWM10 Master Access Control Register
#define SYSCTL_O_EPWM11_AC        0x5CU    // EPWM11 Master Access Control Register
#define SYSCTL_O_EPWM12_AC        0x5EU    // EPWM12 Master Access Control Register
#define SYSCTL_O_EPWM13_AC        0x60U    // EPWM13 Master Access Control Register
#define SYSCTL_O_EPWM14_AC        0x62U    // EPWM14 Master Access Control Register
#define SYSCTL_O_EPWM15_AC        0x64U    // EPWM15 Master Access Control Register
#define SYSCTL_O_EPWM16_AC        0x66U    // EPWM16 Master Access Control Register
#define SYSCTL_O_EQEP1_AC         0x70U    // EQEP1 Master Access Control Register
#define SYSCTL_O_EQEP2_AC         0x72U    // EQEP2 Master Access Control Register
#define SYSCTL_O_EQEP3_AC         0x74U    // EQEP3 Master Access Control Register
#define SYSCTL_O_ECAP1_AC         0x80U    // ECAP1 Master Access Control Register
#define SYSCTL_O_ECAP2_AC         0x82U    // ECAP2 Master Access Control Register
#define SYSCTL_O_ECAP3_AC         0x84U    // ECAP3 Master Access Control Register
#define SYSCTL_O_ECAP4_AC         0x86U    // ECAP4 Master Access Control Register
#define SYSCTL_O_ECAP5_AC         0x88U    // ECAP5 Master Access Control Register
#define SYSCTL_O_ECAP6_AC         0x8AU    // ECAP6 Master Access Control Register
#define SYSCTL_O_ECAP7_AC         0x8CU    // ECAP7 Master Access Control Register
#define SYSCTL_O_SDFM1_AC         0xA8U    // SDFM1 Master Access Control Register
#define SYSCTL_O_SDFM2_AC         0xAAU    // SDFM2 Master Access Control Register
#define SYSCTL_O_CLB1_AC          0xB0U    // CLB1 Master Access Control Register
#define SYSCTL_O_CLB2_AC          0xB2U    // CLB2 Master Access Control Register
#define SYSCTL_O_CLB3_AC          0xB4U    // CLB3 Master Access Control Register
#define SYSCTL_O_CLB4_AC          0xB6U    // CLB4 Master Access Control Register
#define SYSCTL_O_CLB5_AC          0xB8U    // CLB5 Master Access Control Register
#define SYSCTL_O_CLB6_AC          0xBAU    // CLB6 Master Access Control Register
#define SYSCTL_O_CLB7_AC          0xBCU    // CLB7 Master Access Control Register
#define SYSCTL_O_CLB8_AC          0xBEU    // CLB8 Master Access Control Register
#define SYSCTL_O_SPIA_AC          0x110U   // SPIA Master Access Control Register
#define SYSCTL_O_SPIB_AC          0x112U   // SPIB Master Access Control Register
#define SYSCTL_O_SPIC_AC          0x114U   // SPIC Master Access Control Register
#define SYSCTL_O_SPID_AC          0x116U   // SPID Master Access Control Register
#define SYSCTL_O_PMBUS_A_AC       0x130U   // PMBUSA Master Access Control Register
#define SYSCTL_O_CAN_A_AC         0x140U   // CAN_A Master Access Control Register
#define SYSCTL_O_CAN_B_AC         0x142U   // CAN_B Master Access Control Register
#define SYSCTL_O_MCBSPA_AC        0x150U   // MCBSPA Master Access Control Register
#define SYSCTL_O_MCBSPB_AC        0x152U   // MCBSPB Master Access Control Register
#define SYSCTL_O_USBA_AC          0x180U   // USBA Master Access Control Register
#define SYSCTL_O_HRPWM_AC         0x1A8U   // HRPWM Master Access Control Register
#define SYSCTL_O_ETHERCAT_AC      0x1AAU   // ETHERCAT Master Access Control Register
#define SYSCTL_O_FSIATX_AC        0x1B0U   // FSIATX Master Access Control Register
#define SYSCTL_O_FSIARX_AC        0x1B2U   // FSIARX Master Access Control Register
#define SYSCTL_O_FSIBTX_AC        0x1B4U   // FSIBTX Master Access Control Register
#define SYSCTL_O_FSIBRX_AC        0x1B6U   // FSIBRX Master Access Control Register
#define SYSCTL_O_FSICRX_AC        0x1BAU   // FSICRX Master Access Control Register
#define SYSCTL_O_FSIDRX_AC        0x1BEU   // FSIDRX Master Access Control Register
#define SYSCTL_O_FSIERX_AC        0x1C2U   // FSIERX Master Access Control Register
#define SYSCTL_O_FSIFRX_AC        0x1C6U   // FSIFRX Master Access Control Register
#define SYSCTL_O_FSIGRX_AC        0x1CAU   // FSIGRX Master Access Control Register
#define SYSCTL_O_FSIHRX_AC        0x1CEU   // FSIHRX Master Access Control Register
#define SYSCTL_O_MCANA_AC         0x1D0U   // MCANA Master Access Control Register
#define SYSCTL_O_PERIPH_AC_LOCK   0x1FEU   // Lock Register to stop Write access to peripheral
                                           // Access register.

#define SYSCTL_O_CMRESCTL            0x0U     // CM Reset Control Register
#define SYSCTL_O_CMTOCPU1NMICTL      0x2U     // CM To CPU1 NMI Control register
#define SYSCTL_O_CMTOCPU1INTCTL      0x4U     // CM To CPU1 interrupt Control register
#define SYSCTL_O_PALLOCATE0          0x20U    // CM Peripheral Allocation Register.
#define SYSCTL_O_CM_CONF_REGS_LOCK   0x3FEU   // CM Configuration Registers Lock

