TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIERX_AC register
//
//*************************************************************************************************
#define SYSCTL_FSIERX_AC_CPUX_ACC_S   0U
#define SYSCTL_FSIERX_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_FSIERX_AC_CLA1_ACC_S   2U
#define SYSCTL_FSIERX_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_FSIERX_AC_DMA1_ACC_S   4U
#define SYSCTL_FSIERX_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIFRX_AC register
//
//*************************************************************************************************
#define SYSCTL_FSIFRX_AC_CPUX_ACC_S   0U
#define SYSCTL_FSIFRX_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_FSIFRX_AC_CLA1_ACC_S   2U
#define SYSCTL_FSIFRX_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_FSIFRX_AC_DMA1_ACC_S   4U
#define SYSCTL_FSIFRX_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIGRX_AC register
//
//*************************************************************************************************
#define SYSCTL_FSIGRX_AC_CPUX_ACC_S   0U
#define SYSCTL_FSIGRX_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_FSIGRX_AC_CLA1_ACC_S   2U
#define SYSCTL_FSIGRX_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_FSIGRX_AC_DMA1_ACC_S   4U
#define SYSCTL_FSIGRX_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIHRX_AC register
//
//*************************************************************************************************
#define SYSCTL_FSIHRX_AC_CPUX_ACC_S   0U
#define SYSCTL_FSIHRX_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_FSIHRX_AC_CLA1_ACC_S   2U
#define SYSCTL_FSIHRX_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_FSIHRX_AC_DMA1_ACC_S   4U
#define SYSCTL_FSIHRX_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANA_AC register
//
//*************************************************************************************************
#define SYSCTL_MCANA_AC_CPUX_ACC_S   0U
#define SYSCTL_MCANA_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_MCANA_AC_DMA1_ACC_S   4U
#define SYSCTL_MCANA_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERIPH_AC_LOCK register
//
//*************************************************************************************************
#define SYSCTL_PERIPH_AC_LOCK_LOCK_AC_WR   0x1U   // Lock control for Access control registers
                                                  // write.


//*************************************************************************************************
//
// The following are defines for the bit fields in the CMRESCTL register
//
//*************************************************************************************************
#define SYSCTL_CMRESCTL_RESET      0x1U          // Software reset to CM
#define SYSCTL_CMRESCTL_RESETSTS   0x2U          // CM Reset status
#define SYSCTL_CMRESCTL_KEY_S      16U
#define SYSCTL_CMRESCTL_KEY_M      0xFFFF0000U   // Key value

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1NMICTL register
//
//*************************************************************************************************
#define SYSCTL_CMTOCPU1NMICTL_CMNMIWDRST   0x4U   // CMNMIWDRST NMI enable bit, enables nmi
                                                  // generation to C28x

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1INTCTL register
//
//*************************************************************************************************
#define SYSCTL_CMTOCPU1INTCTL_VECTRESET     0x1U   // VECTRESET Interrupt enable bit, enables
                                                   // interrupt to C28x
#define SYSCTL_CMTOCPU1INTCTL_SYSRESETREQ   0x2U   // SYSRESETREQ Interrupt enable bit, enables
                                                   // interrupt to C28x
#define SYSCTL_CMTOCPU1INTCTL_CMNMIWDRST    0x4U   // CMNMIWDRST Interrupt enable bit, enables
                                                   // interrupt to C28x

//*************************************************************************************************
//
// The following are defines for the bit fields in the PALLOCATE0 register
//
//*************************************************************************************************
#define SYSCTL_PALLOCATE0_USB_A      0x1U    // Allocate USB_A to CM
#define SYSCTL_PALLOCATE0_ETHERCAT   0x2U    // Allocate ETHERCAT to CM
#define SYSCTL_PALLOCATE0_CAN_A      0x4U    // Allocate CANA to CM
#define SYSCTL_PALLOCATE0_CAN_B      0x8U    // Allocate CANB to CM
#define SYSCTL_PALLOCATE0_MCAN_A     0x10U   // Allocate MCANA to CM

//*************************************************************************************************
//
// The following are defines for the bit fields in the CM_CONF_REGS_LOCK register
//
//*************************************************************************************************
#define SYSCTL_CM_CONF_REGS_LOCK_LOCK   0x1U   // Lock one time CM configuration registers.


//*************************************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_FLG register
//
//*************************************************************************************************
#define SYSCTL_CM_STATUS_INT_FLG_GINT            0x1U   // Global Interrupt flag
#define SYSCTL_CM_STATUS_INT_FLG_CMNMIWDRST      0x2U   // CMNMIWDRST caused a reset of CM
#define SYSCTL_CM_STATUS_INT_FLG_CMSYSRESETREQ   0x4U   // CMSYSRESETREQ caused a reset of CM
#define SYSCTL_CM_STATUS_INT_FLG_CMVECTRESET     0x8U   // CMVECTRESET caused a reset of CM

//*************************************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_CLR register
//
//*************************************************************************************************
#define SYSCTL_CM_STATUS_INT_CLR_GINT            0x1U   // Global Interrupt flag Clear bit
#define SYSCTL_CM_STATUS_INT_CLR_CMNMIWDRST      0x2U   // CMNMIWDRST interrupt flag clear bit
#define SYSCTL_CM_STATUS_INT_CLR_CMSYSRESETREQ   0x4U   // CMSYSRESETREQ interrupt flag clear bit
#define SYSCTL_CM_STATUS_INT_CLR_CMVECTRESET     0x8U   // CMVECTRESET interrupt flag clear bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_SET register
//
//*************************************************************************************************
#define SYSCTL_CM_STATUS_INT_SET_CMNMIWDRST      0x2U          // CMNMIWDRST interrupt flag set bit
#define SYSCTL_CM_STATUS_INT_SET_CMSYSRESETREQ   0x4U          // CMSYSRESETREQ interrupt flag set
                                                               // bit
#define SYSCTL_CM_STATUS_INT_SET_CMVECTRESET     0x8U          // CMVECTRESET interrupt flag set
                                                               // bit
#define SYSCTL_CM_STATUS_INT_SET_KEY_S           16U
#define SYSCTL_CM_STATUS_INT_SET_KEY_M           0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_MASK register
//
//*************************************************************************************************
#define SYSCTL_CM_STATUS_MASK_CMNMIWDRST      0x2U          // CMNMIWDRST flag mask bit
#define SYSCTL_CM_STATUS_MASK_CMSYSRESETREQ   0x4U          // CMSYSRESETREQ interrupt flag set bit
#define SYSCTL_CM_STATUS_MASK_CMVECTRESET     0x8U          // CMVECTRESET interrupt flag set bit
#define SYSCTL_CM_STATUS_MASK_KEY_S           16U
#define SYSCTL_CM_STATUS_MASK_KEY_M           0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_FLG register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_FLG_GINT                        0x1U     // Global Interrupt flag
#define SYSCTL_SYS_ERR_INT_FLG_EMIF_ERR                    0x2U     // EMIF error event flag
#define SYSCTL_SYS_ERR_INT_FLG_RAM_CORRECTABLE_ERR         0x4U     // RAM correctable error flag
#define SYSCTL_SYS_ERR_INT_FLG_FLASH_CORRECTABLE_ERR       0x8U     // FLASH correctable error flag
#define SYSCTL_SYS_ERR_INT_FLG_RAM_ACC_VIOL                0x10U    // RAM access vioation flag.
#define SYSCTL_SYS_ERR_INT_FLG_SYS_PLL_SLIP_NOTSUPPORTED   0x20U    // System PLL Slip event flag.
#define SYSCTL_SYS_ERR_INT_FLG_AUX_PLL_SLIP_NOTSUPPORTED   0x40U    // Auxillary PLL Slip event
                                                                    // flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC0                        0x80U    // DCC0 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC1                        0x100U   // DCC1 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC2                        0x200U   // DCC2 Interrupt flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_CLR register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_CLR_GINT                        0x1U     // Global Interrupt flag Clear
                                                                    // bit
#define SYSCTL_SYS_ERR_INT_CLR_EMIF_ERR                    0x2U     // EMIF_ERR interrupt flag
                                                                    // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_CORRECTABLE_ERR         0x4U     // RAM_CORRECTABLE_ERR
                                                                    // interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_FLASH_CORRECTABLE_ERR       0x8U     // FLASH_CORRECTABLE_ERR
                                                                    // interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_ACC_VIOL                0x10U    // RAM_ACC_VIOL interrupt flag
                                                                    // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_SYS_PLL_SLIP_NOTSUPPORTED   0x20U    // SYS_PLL_SLIP interrupt flag
                                                                    // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_AUX_PLL_SLIP_NOTSUPPORTED   0x40U    // AUX_PLL_SLIP interrupt flag
                                                                    // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC0                        0x80U    // DCC0 interrupt flag clear
                                                                    // bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC1                        0x100U   // DCC1 interrupt flag clear
                                                                    // bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC2                        0x200U   // DCC2 interrupt flag clear
                                                                    // bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_SET register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_SET_EMIF_ERR                    0x2U          // Reserved
#define SYSCTL_SYS_ERR_INT_SET_RAM_CORRECTABLE_ERR         0x4U          // RAM_CORRECTABLE_ERR
                                                                         // interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_FLASH_CORRECTABLE_ERR       0x8U          // FLASH_CORRECTABLE_ERR
                                                                         // interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_RAM_ACC_VIOL                0x10U         // RAM_ACC_VIOL interrupt
                                                                         // flag set bit
#define SYSCTL_SYS_ERR_INT_SET_SYS_PLL_SLIP_NOTSUPPORTED   0x20U         // SYS_PLL_SLIP interrupt
                                                                         // flag set bit
#define SYSCTL_SYS_ERR_INT_SET_AUX_PLL_SLIP_NOTSUPPORTED   0x40U         // AUX_PLL_SLIP interrupt
                                                                         // flag set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC0                        0x80U         // DCC0 interrupt flag set
                                                                         // bit
#define SYSCTL_SYS_ERR_INT_SET_DCC1                        0x100U        // DCC1 interrupt flag set
                                                                         // bit
#define SYSCTL_SYS_ERR_INT_SET_DCC2                        0x200U        // DCC2 interrupt flag set
                                                                         // bit
#define SYSCTL_SYS_ERR_INT_SET_KEY_S                       16U
#define SYSCTL_SYS_ERR_INT_SET_KEY_M                       0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_MASK register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_MASK_EMIF_ERR                0x2U          // Reserved
#define SYSCTL_SYS_ERR_MASK_RAM_CORRECTABLE_ERR     0x4U          // RAM_CORRECTABLE_ERR flag mask
                                                                  // bit
#define SYSCTL_SYS_ERR_MASK_FLASH_CORRECTABLE_ERR   0x8U          // FLASH_CORRECTABLE_ERR flag
                                                                  // mask bit
#define SYSCTL_SYS_ERR_MASK_RAM_ACC_VIOL            0x10U         // RAM_ACC_VIOL flag mask bit
#define SYSCTL_SYS_ERR_MASK_SYS_PLL_SLIP            0x20U         // SYS_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_AUX_PLL_SLIP            0x40U         // AUX_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC0                    0x80U         // DCC0 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC1                    0x100U        // DCC1 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC2                    0x200U        // DCC2 flag mask bit
#define SYSCTL_SYS_ERR_MASK_KEY_S                   16U
#define SYSCTL_SYS_ERR_MASK_KEY_M                   0xFFFF0000U   // KEY field


//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSELECT register
//
//*************************************************************************************************
#define SYSCTL_SYNCSELECT_SYNCOUT_S   24U
#define SYSCTL_SYNCSELECT_SYNCOUT_M   0x1F000000U   // Select Syncout Source

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT register
//
//*************************************************************************************************
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCAEN    0x1U          // PWM1SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCAEN    0x2U          // PWM2SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCAEN    0x4U          // PWM3SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCAEN    0x8U          // PWM4SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCAEN    0x10U         // PWM5SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCAEN    0x20U         // PWM6SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCAEN    0x40U         // PWM7SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCAEN    0x80U         // PWM8SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCAEN    0x100U        // PWM9SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCAEN   0x200U        // PWM10SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCAEN   0x400U        // PWM11SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCAEN   0x800U        // PWM12SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCAEN   0x1000U       // PWM13SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCAEN   0x2000U       // PWM14SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCAEN   0x4000U       // PWM15SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCAEN   0x8000U       // PWM16SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCBEN    0x10000U      // PWM1SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCBEN    0x20000U      // PWM2SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCBEN    0x40000U      // PWM3SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCBEN    0x80000U      // PWM4SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCBEN    0x100000U     // PWM5SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCBEN    0x200000U     // PWM6SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCBEN    0x400000U     // PWM7SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCBEN    0x800000U     // PWM8SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCBEN    0x1000000U    // PWM9SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCBEN   0x2000000U    // PWM10SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCBEN   0x4000000U    // PWM11SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCBEN   0x8000000U    // PWM12SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCBEN   0x10000000U   // PWM13SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCBEN   0x20000000U   // PWM14SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCBEN   0x40000000U   // PWM15SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCBEN   0x80000000U   // PWM16SOCBEN Enable for ADCSOCBOn

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSOCLOCK register
//
//*************************************************************************************************
#define SYSCTL_SYNCSOCLOCK_SYNCSELECT        0x1U   // SYNCSEL Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT   0x2U   // ADCSOCOUTSELECT Register Lock bit



#endif
